"""Сборник всех констант"""

SCREEN_WIDTH = 1000  # ширина экрана
SCREEN_HEIGHT = 600  # высота экрана
COLOR_WHITE = 255, 255, 255
COLOR_BLACK = 0, 0, 0
COLOR_BROWN = 165, 42, 42
RECT_SIDE = 20  # размер одного квадратика
COLOR_ANTHILL = 219, 100, 2
BORDER_COLOR = 69, 68, 67  # цвет сетки
FOOD_COLOR = 237, 227, 28
ANT_COLOR = 237, 178, 28
WALL_COLOR = 68, 171, 87
FOOD_VALUE = 10  # сколько муравьев может накормить 1 клетка
HAVE_FOOD_FER = 60, 181, 167  # цвет который появляется за муравьем когда у него есть еда
DONT_HAVE_FOOD = 222, 51, 114  # цвет, который появляется когда у муравья нет еды
ANT_COUNT = 10  # кол-во муравьев, выпускаемых муравейником
FOOD_FILL = 102  # кнопка чтобы поставить еду
WALL_FILL = 119  # кнопка чтобы поставить стену
RADIUS_ANT = 40  # радиус зрения муровья
ANT_ANGLE = 180 # угол зрения муровья
